load_testing/results_for_report/key-value/cons_hash_3_peaks_360s_10keys.txt
CONNECTED to addr	172.31.11.13:3000
CONNECTED to addr	172.31.10.136:3000
all addrs:
1	172.31.11.13:3000
2	172.31.10.136:3000
thread addr: 172.31.11.13:3000
all addrs:
1	172.31.11.13:3000
2	172.31.10.136:3000
thread addr: 172.31.10.136:3000
Running 6m test @ http://172.31.11.13:3000
  2 threads and 200 connections
  Thread calibration: mean lat.: 100.813ms, rate sampling interval: 606ms
  Thread calibration: mean lat.: 95.167ms, rate sampling interval: 554ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.79s     6.17s   29.72s    85.63%
    Req/Sec     1.63k   274.41     2.67k    77.69%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   32.35ms
 75.000%  371.45ms
 90.000%   13.69s 
 99.000%   24.07s 
 99.900%   27.05s 
 99.990%   28.72s 
 99.999%   29.33s 
100.000%   29.74s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       1.497     0.000000            1         1.00
      11.175     0.100000       113748         1.11
      16.687     0.200000       227521         1.25
      21.919     0.300000       341091         1.43
      26.847     0.400000       454822         1.67
      32.351     0.500000       568243         2.00
      35.807     0.550000       625305         2.22
      40.095     0.600000       682147         2.50
      46.303     0.650000       738743         2.86
      63.743     0.700000       795507         3.33
     371.455     0.750000       852310         4.00
     852.991     0.775000       880731         4.44
    1762.303     0.800000       909124         5.00
    4841.471     0.825000       937555         5.71
    8105.983     0.850000       965952         6.67
   11067.391     0.875000       994393         8.00
   12337.151     0.887500      1008594         8.89
   13688.831     0.900000      1022794        10.00
   15048.703     0.912500      1036982        11.43
   16441.343     0.925000      1051212        13.33
   17727.487     0.937500      1065446        16.00
   18399.231     0.943750      1072641        17.78
   19054.591     0.950000      1079697        20.00
   19693.567     0.956250      1086749        22.86
   20381.695     0.962500      1093803        26.67
   21053.439     0.968750      1101024        32.00
   21413.887     0.971875      1104492        35.56
   21774.335     0.975000      1108014        40.00
   22183.935     0.978125      1111623        45.71
   22659.071     0.981250      1115201        53.33
   23134.207     0.984375      1118674        64.00
   23363.583     0.985938      1120532        71.11
   23625.727     0.987500      1122207        80.00
   23887.871     0.989062      1124017        91.43
   24166.399     0.990625      1125776       106.67
   24461.311     0.992188      1127530       128.00
   24641.535     0.992969      1128459       142.22
   24821.759     0.993750      1129374       160.00
   25051.135     0.994531      1130228       182.86
   25313.279     0.995313      1131099       213.33
   25526.271     0.996094      1131993       256.00
   25673.727     0.996484      1132443       284.44
   25821.183     0.996875      1132888       320.00
   25968.639     0.997266      1133344       365.71
   26099.711     0.997656      1133747       426.67
   26312.703     0.998047      1134208       512.00
   26394.623     0.998242      1134407       568.89
   26525.695     0.998437      1134654       640.00
   26689.535     0.998633      1134861       731.43
   26853.375     0.998828      1135076       853.33
   27066.367     0.999023      1135308      1024.00
   27164.671     0.999121      1135414      1137.78
   27246.591     0.999219      1135518      1280.00
   27377.663     0.999316      1135634      1462.86
   27541.503     0.999414      1135739      1706.67
   27721.727     0.999512      1135856      2048.00
   27820.031     0.999561      1135909      2275.56
   27967.487     0.999609      1135963      2560.00
   28098.559     0.999658      1136021      2925.71
   28196.863     0.999707      1136073      3413.33
   28295.167     0.999756      1136127      4096.00
   28360.703     0.999780      1136156      4551.11
   28409.855     0.999805      1136183      5120.00
   28508.159     0.999829      1136214      5851.43
   28573.695     0.999854      1136244      6826.67
   28639.231     0.999878      1136269      8192.00
   28671.999     0.999890      1136281      9102.22
   28721.151     0.999902      1136297     10240.00
   28753.919     0.999915      1136308     11702.86
   28819.455     0.999927      1136321     13653.33
   28868.607     0.999939      1136336     16384.00
   28901.375     0.999945      1136347     18204.44
   28917.759     0.999951      1136351     20480.00
   28966.911     0.999957      1136356     23405.71
   28999.679     0.999963      1136365     27306.67
   29032.447     0.999969      1136371     32768.00
   29065.215     0.999973      1136374     36408.89
   29163.519     0.999976      1136381     40960.00
   29163.519     0.999979      1136381     46811.43
   29196.287     0.999982      1136385     54613.33
   29212.671     0.999985      1136388     65536.00
   29245.439     0.999986      1136391     72817.78
   29245.439     0.999988      1136391     81920.00
   29294.591     0.999989      1136392     93622.86
   29327.359     0.999991      1136394    109226.67
   29360.127     0.999992      1136396    131072.00
   29507.583     0.999993      1136398    145635.56
   29507.583     0.999994      1136398    163840.00
   29507.583     0.999995      1136398    187245.71
   29523.967     0.999995      1136399    218453.33
   29556.735     0.999996      1136400    262144.00
   29687.807     0.999997      1136401    291271.11
   29687.807     0.999997      1136401    327680.00
   29687.807     0.999997      1136401    374491.43
   29720.575     0.999998      1136403    436906.67
   29720.575     0.999998      1136403    524288.00
   29720.575     0.999998      1136403    582542.22
   29720.575     0.999998      1136403    655360.00
   29720.575     0.999999      1136403    748982.86
   29720.575     0.999999      1136403    873813.33
   29720.575     0.999999      1136403   1048576.00
   29736.959     0.999999      1136404   1165084.44
   29736.959     1.000000      1136404          inf
#[Mean    =     2788.376, StdDeviation   =     6170.303]
#[Max     =    29720.576, Total count    =      1136404]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  1169622 requests in 6.00m, 300.45MB read
  Non-2xx or 3xx responses: 2
Requests/sec:   3248.85
Transfer/sec:    854.59KB
thread 0 made 584782 requests and got 584682 responses
thread 1 made 585039 requests and got 584940 responses
2022-06-04 23:43:07.086 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: NaN 
2022-06-04 23:43:12.205 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 1.154382470119522 
2022-06-04 23:43:17.118 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 1.1617973688706646 
2022-06-04 23:43:22.143 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 1.1655817737998373 
2022-06-04 23:43:27.112 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 1.1594412053339491 
2022-06-04 23:43:32.128 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 1.1563180203917975 
2022-06-04 23:43:37.117 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 1.1469267955801106 
2022-06-04 23:43:42.152 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 1.1708321418358594 
2022-06-04 23:43:47.162 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 1.1822454308093995 
2022-06-04 23:43:52.165 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 1.1827188940092166 
2022-06-04 23:43:57.104 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 1.1817706517950506 
2022-06-04 23:44:02.612 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 1.188097893068842 
2022-06-04 23:44:07.119 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 1.2133294864397 
2022-06-04 23:44:12.189 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 1.1546131805157593 
2022-06-04 23:44:17.114 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 1.179162552993786 
2022-06-04 23:44:22.133 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 1.201878201479795 
2022-06-04 23:44:27.138 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 1.166551724137931 
2022-06-04 23:44:32.217 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 1.1703202111786983 
2022-06-04 23:44:37.145 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 1.1571478422705597 
2022-06-04 23:44:42.124 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 1.1844827586206896 
2022-06-04 23:44:47.154 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 1.1694886266461433 
2022-06-04 23:44:52.137 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 1.160344827586207 
2022-06-04 23:44:57.146 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 1.1623295454545455 
2022-06-04 23:45:02.544 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 1.1328138528138527 
2022-06-04 23:45:07.233 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 1.1852820321255135 
2022-06-04 23:45:12.198 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 1.1557253611467455 
2022-06-04 23:45:17.156 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 1.159962960819492 
2022-06-04 23:45:22.141 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 1.1798275862068965 
2022-06-04 23:45:27.174 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 1.0202733485193622 
2022-06-04 23:45:32.173 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 1.0304973141569918 
2022-06-04 23:45:37.160 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 1.0148378191856453 
2022-06-04 23:45:42.180 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 1.0237551393330289 
2022-06-04 23:45:47.169 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 1.0033941206926307 
2022-06-04 23:45:52.188 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 1.0383891392390623 
2022-06-04 23:45:57.160 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 1.021243612562439 
2022-06-04 23:46:02.623 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 1.018403509771523 
2022-06-04 23:46:07.163 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 1.0102951678171865 
2022-06-04 23:46:12.196 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 1.0074524974399819 
2022-06-04 23:46:17.181 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 1.047553411440386 
2022-06-04 23:46:22.187 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 1.0148807813846594 
2022-06-04 23:46:27.169 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 1.0429310344827587 
2022-06-04 23:46:32.184 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 1.0192056366839026 
2022-06-04 23:46:37.177 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 1.016551724137931 
2022-06-04 23:46:42.200 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 1.034055016367082 
2022-06-04 23:46:47.175 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 1.0310551835603785 
2022-06-04 23:46:52.218 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 1.025451418744626 
2022-06-04 23:46:57.215 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 1.0148961868062345 
2022-06-04 23:47:02.583 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 1.0326080020419883 
2022-06-04 23:47:07.217 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 1.0396642967872989 
2022-06-04 23:47:12.188 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 1.0191379310344828 
2022-06-04 23:47:17.225 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 1.0357467606274153 
2022-06-04 23:47:22.192 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 1.013851370768435 
2022-06-04 23:47:27.214 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 1.0078418002045686 
2022-06-04 23:47:32.197 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 1.036896551724138 
2022-06-04 23:47:37.305 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 1.575553541369934 
2022-06-04 23:47:42.337 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 2.05665654466997 
2022-06-04 23:47:47.366 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 2.069494509179311 
2022-06-04 23:47:52.352 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 2.055243295326803 
2022-06-04 23:47:57.409 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 2.068542681968244 
2022-06-04 23:48:02.340 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 2.0817181340341655 
2022-06-04 23:48:07.441 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 2.0535135135135136 
2022-06-04 23:48:12.395 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 2.080831954620657 
2022-06-04 23:48:17.357 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 2.038739021329987 
2022-06-04 23:48:22.389 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 2.0602158828064767 
2022-06-04 23:48:27.385 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 2.0601408562158743 
2022-06-04 23:48:32.408 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 2.07424206254476 
2022-06-04 23:48:37.417 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 2.0590047758434755 
2022-06-04 23:48:42.400 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 2.0603003284842796 
2022-06-04 23:48:47.391 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 2.0489445604268153 
2022-06-04 23:48:52.355 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 2.0587173247507655 
2022-06-04 23:48:57.371 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 2.0481435834232014 
2022-06-04 23:49:02.504 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 2.0484488552004376 
2022-06-04 23:49:07.381 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 2.0787884171255997 
2022-06-04 23:49:12.237 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 2.0796080832823023 
2022-06-04 23:49:17.239 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: NaN